README.org
#+PROPERTY: header-args :tangle init.el :comments org

* COMMENT package.el

#+begin_src emacs-lisp
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(package-initialize)
#+end_src

* user--packages

#+begin_src emacs-lisp
(defvar user--packages (expand-file-name (file-name-concat user-emacs-directory "elisp"))
  "Where users adds its elisp files and packages.")
(add-to-list 'load-path user--packages)
#+end_src

* use-package

#+begin_src emacs-lisp
(eval-when-compile (require 'use-package))
#+end_src

* emacs

#+begin_src emacs-lisp
(use-package emacs
  :init
  (require 'user-calendar)
  (require 'user-editing)
  (require 'user-ui)
  (require 'user-startup)
  (require 'user-buffer)
  (require 'user-mini-buffer)
  (require 'user-external-processes)
  (require 'user-backup)
  (require 'user-key-bindings)
  (require 'user-utils)
  (require 'org-patches))
#+end_src

** calendar
:PROPERTIES:
:header-args+: :tangle elisp/user-calendar.el
:END:

#+begin_src emacs-lisp
(setq calendar-week-start-day 1)
(setq holiday-bahai-holidays nil)
(setq holiday-hebrew-holidays nil)
(setq holiday-islamic-holidays nil)
(setq holiday-oriental-holidays nil)
(provide 'user-calendar)
#+end_src

** editing
:PROPERTIES:
:header-args+: :tangle elisp/user-editing.el
:END:

1. (add-hook 'before-save-hook #'whitespace-cleanup) does not work,
   because it removes tabs in makefile code blocks.

#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
;; (setq whitespace-style '(face tabs trailing lines-tail))
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(delete-selection-mode 1)
(global-auto-revert-mode t)
(put 'narrow-to-region 'disabled nil)
(setq load-prefer-newer t)
(setq custom-file (locate-user-emacs-file "custom-vars.el"))
(load custom-file 'noerror 'nomessage)
(provide 'user-editing)
#+end_src

** ui
:PROPERTIES:
:header-args+: :tangle elisp/user-ui.el
:END:

#+begin_src emacs-lisp
(pixel-scroll-precision-mode 1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode 1)
(setq-default cursor-type 'bar)
(setq-default fill-column 85)
(column-number-mode 1)
(setq frame-title-format '("%b"))
(fset 'yes-or-no-p 'y-or-n-p)
(setq ring-bell-function 'ignore)
(add-to-list 'default-frame-alist '(font . "JetBrains Mono"))
(provide 'user-ui)
#+end_src

** startup
:PROPERTIES:
:header-args+: :tangle elisp/user-startup.el
:END:

#+begin_src emacs-lisp
(setq inhibit-startup-screen t)
(setq initial-scratch-message "")
(provide 'user-startup)
#+end_src

** buffer
:PROPERTIES:
:header-args+: :tangle elisp/user-buffer.el
:END:

#+begin_src emacs-lisp
(setq uniquify-buffer-name-style 'post-forward)
(setq uniquify-strip-common-suffix nil)
(provide 'user-buffer)
#+end_src

** mini-buffer
:PROPERTIES:
:header-args+: :tangle elisp/user-mini-buffer.el
:END:

#+begin_src emacs-lisp
(setq enable-recursive-minibuffers t)
(provide 'user-mini-buffer)
#+end_src

** external-processes
:PROPERTIES:
:header-args+: :tangle elisp/user-external-processes.el
:END:

#+begin_src emacs-lisp
(setq read-process-output-max (* 1024 1024))
(provide 'user-external-processes)
#+end_src

** backup
:PROPERTIES:
:header-args+: :tangle elisp/user-backup.el
:END:

#+begin_src emacs-lisp
(defconst emacs-tmp-dir (expand-file-name (format "emacs%d" (user-uid)) temporary-file-directory))
(setq create-lockfiles nil)
(setq delete-by-moving-to-trash t)
(setq
 backup-by-copying t
 delete-old-versions t
 kept-new-versions 6
 kept-old-versions 2
 version-control t
 auto-save-list-file-prefix emacs-tmp-dir
 auto-save-file-name-transforms `((".*" ,emacs-tmp-dir t))
 backup-directory-alist `((".*" . ,emacs-tmp-dir)))
(provide 'user-backup)
#+end_src

** key-bindings
:PROPERTIES:
:header-args+: :tangle elisp/user-key-bindings.el
:END:

#+begin_src emacs-lisp
(global-set-key (kbd "C-$") #'clone-indirect-buffer-other-window)
(global-set-key (kbd "C-c l") #'org-store-link)
(provide 'user-key-bindings)
#+end_src

** utils
:PROPERTIES:
:header-args+: :tangle elisp/user-utils.el
:END:

#+begin_src emacs-lisp
(defun unfill-paragraph (&optional region)
  "Takes a multi-line paragraph and makes it into a single line of text."

  (interactive (progn (barf-if-buffer-read-only) '(t)))
  (let ((fill-column (point-max))
	;; This would override `fill-column' if it's an integer.
	(emacs-lisp-docstring-fill-column t))
    (fill-paragraph nil region)))

(defun dedicate-window (&optional arg)
  "Set current window to be dedicated.
With prefix ARG, undedicate it."
  (interactive "P")
  (set-window-dedicated-p (get-buffer-window (current-buffer)) (not arg))
  (message (if arg
	       "Window '%s' is normal"
	     "Window '%s' is dedicated")
	   (current-buffer)))
(provide 'user-utils)
#+end_src

* gcmh

1. GC occurs after Emacs has been idle for come time.
2. See: https://akrl.sdf.org/#orgc15a10d

#+begin_src emacs-lisp
(use-package gcmh :demand
  :config
  (setq gcmh-verbose t)
  (gcmh-mode))
#+end_src

* recentf

1. Emacs remembers the last couple of files it has opened.

#+begin_src emacs-lisp
(use-package recentf :demand
  :config
  (recentf-mode)
  (setq recentf-max-menu-items 20)
  (setq recentf-max-saved-items 100)
  (run-at-time nil (* 5 60) 'recentf-save-list))
#+end_src

* dired

1. dired buffers display minimum amount of information by default.

#+begin_src emacs-lisp
(use-package dired :demand
  :hook (dired-mode . dired-hide-details-mode)
  :config
  (setq dired-dwim-target t))
#+end_src

* paren

1. Matching parentheses are highlighted.

#+begin_src emacs-lisp
(use-package paren :demand
  :config
  (show-paren-mode 1))
#+end_src

* elec-pair

1. Parentheses are inserted by pair.

#+begin_src emacs-lisp
(use-package elec-pair :demand
  :config
  (electric-pair-mode 1))
#+end_src

* theme

1. Dark theme is enabled.

#+begin_src emacs-lisp
(use-package modus-themes :demand
  :bind ([f12] . modus-themes-toggle)
  :config
  (setq modus-themes-hl-line  '(intense accented))
  (setq x-underline-at-descent-line t)
  (setq modus-themes-intense-markup t)
  (setq modus-themes-italic-constructs t
	modus-themes-bold-constructs nil
	modus-themes-region '(bg-only no-extend))
  (load-theme 'modus-vivendi-tinted :no-confirm))
#+end_src

* treesit

1. treesitter may be used.

#+begin_src emacs-lisp
(use-package treesit :demand)
#+end_src

* treemacs

1. directory structure may be displayed.

#+begin_src emacs-lisp
(use-package treemacs)
#+end_src

* hl-line

1. The current line is highlighted.

#+begin_src emacs-lisp
(use-package hl-line :demand
  :config
  (global-hl-line-mode 1))
#+end_src

* diff-hl

1. If a file is managed by a version manager like Git,
   then highlight the differences introduced.

#+begin_src emacs-lisp
(use-package diff-hl
  :config
  (when (null vc-handled-backends)
    (message "%s" "global-diff-hl-mode cannot work. See documentation.")))
#+end_src

* iedit

1. If a region is selected and the key sequence pressed,
   then all the occurrences of the current region in the buffer are highlighted.
2. If one occurrence is modified,
   then change are propagated to all other occurrences simultaneously.

#+begin_src emacs-lisp
(use-package iedit :demand
  :bind ("C-;" . iedit-mode))
#+end_src

* repeat

1. Most recently executed command may be repeated.

#+begin_src emacs-lisp
(use-package repeat :demand)
#+end_src

* imenu

1. If activated, then Jump to a place in the buffer chosen
   using a buffer menu or mouse menu.

#+begin_src emacs-lisp
(use-package imenu :demand
  :config
  (setq imenu-auto-rescan t))
#+end_src

* tab-bar

#+begin_src emacs-lisp
(use-package tab-bar :demand
  :bind
  (("C-+" . tab-bar-switch-to-next-tab)
   ("C--" . tab-bar-switch-to-prev-tab))
  :config
  (tab-bar-mode))
#+end_src

* avy

1. The point may be moved anywhere in a few keystrokes.

#+begin_src emacs-lisp
(use-package avy :demand
  :bind
  ("C-:" . avy-goto-char))
#+end_src

* expand-region

1. If keys sequence is pressed, then the selected region is incread by semantic units.

#+begin_src emacs-lisp
(use-package expand-region :demand
  :bind
  ("C-<" . er/expand-region))
#+end_src

* magit

#+begin_src emacs-lisp
(use-package magit
  :config
  (defun transient-prefix-object ()
    (or transient--prefix transient-current-prefix))
  (setq magit-diff-refine-hunk (quote all))
  :bind
  (("C-x g" . magit-status)))
#+end_src

* paredit

#+begin_src emacs-lisp
(use-package paredit
  :hook
  (emacs-lisp-mode . paredit-mode)
  (scheme-mode . paredit-mode))
#+end_src

* rainbow-delimiters

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

* geiser

#+begin_src emacs-lisp
(use-package geiser
  :demand
  :config
  (setq geiser-active-implementations '(guile))
  (setq geiser-default-implementation 'guile)
  :hook
  (scheme-mode . geiser-mode))

(use-package geiser-guile
  :demand
  :config
  (add-to-list 'geiser-guile-load-path "~/src/guix"))

(use-package macrostep
  :demand)

(use-package macrostep-geiser
  :defer t
  :after (geiser macrostep)
  :config
  (add-hook 'geiser-mode-hook #'macrostep-geiser-setup)
  (add-hook 'geiser-repl-mode-hook #'macrostep-geiser-setup))
#+end_src
* esup

#+begin_src emacs-lisp
(use-package esup
  :defer t
  :commands (esup))
#+end_src

* rg

#+begin_src emacs-lisp
(use-package rg :demand
  :config
  (rg-enable-default-bindings)
  (setq rg-command-line-flags '()))
#+end_src

* vertico

1. If Emacs offers options to choose from, then display a vertical completion UI.

#+begin_src emacs-lisp
(use-package vertico
  :demand
  :config
  (vertico-mode)
  (setq vertico-scroll-margin 0)
  (setq vertico-count 20)
  (setq vertico-resize t)
  (setq vertico-cycle t)
  ;; Optional: Enable vertico-multiform for better completion UI
  (vertico-multiform-mode)
  (setq vertico-multiform-categories
        '((file grid)
          (consult-grep buffer))))
#+end_src

* xref

#+begin_src emacs-lisp
(use-package xref :demand)
#+end_src

* consult

1. Search and navigation commands based on the Emacs completion function completing-read,
   are provided.
2. For instance, compare ~consult-imenu~ and ~imenu~.

#+begin_src emacs-lisp
(use-package consult
  :demand
  :bind
  (("C-s" . consult-line)
   ("C-r" . consult-ripgrep)
   ("C-c f" . consult-find)
   ("M-." . xref-find-definitions)
   ("M-i" . consult-imenu)
   ("C-x b" . consult-buffer)
   ("C--" . consult-mark)
   ("C-y" . consult-yank-replace)
   ("C-z" . consult-recent-file)
   ("M-g g" . consult-goto-line))
  :hook
  (completion-list-mode . consult-preview-at-point-mode)
  :config
  (advice-add #'register-preview :override #'consult-register-window)
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref))
#+end_src

* orderless

1. Orderless completion style that divides the pattern into space-separated components,
   and matches candidates that match all of the components in any order is provided.

#+begin_src emacs-lisp
(use-package orderless :demand
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src

* marginalia

1. Meta-data are added to completion candidates like descriptions.
2. Cycle annotators using the provided key sequence

#+begin_src emacs-lisp
(use-package marginalia :demand
  :bind (:map minibuffer-local-map
	 ("M-A" . marginalia-cycle))

  :config
  (marginalia-mode))
#+end_src

* yasnippet

#+begin_src emacs-lisp
(use-package yasnippet :demand
  :init
  (require 'f)
  :config
  (setq yas--default-user-snippets-dir nil)
  (add-to-list 'yas-snippet-dirs (f-join user-emacs-directory "snippets"))
  (setq yas-new-snippet-default
	"# -*- mode: snippet -*-
# name: $1
# key: ${2:${1:$(yas--key-from-desc yas-text)}}
# expand-env: ((yas-indent-line 'fixed) (yas-wrap-around-region 'nil))
# --
$0`(yas-escape-text yas-selected-text)`")
  (yas-global-mode))
#+end_src

* corfu

1. In-buffer completion is enhanced with a small completion popup.

#+begin_src emacs-lisp
(use-package corfu
  :disabled t
  :demand
  :bind (:map corfu-map
	      ("M-SPC"      . corfu-insert-separator)
	      ("TAB"        . corfu-next)
	      ([tab]        . corfu-next)
	      ("S-TAB"      . corfu-previous)
	      ([backtab]    . corfu-previous)
	      ("RET"        . corfu-insert))
  :custom
  (corfu-cycle t)
  (corfu-auto nil)
  (corfu-quit-no-match 'separator)
  (corfu-auto-prefix 2)
  (corfu-auto-delay 0.1)
  (corfu-popupinfo-delay '(0.5 . 0.2))
  (corfu-preview-current 'insert)
  (corfu-preselect 'prompt)
  (corfu-on-exact-match nil)
  :config
  (corfu-history-mode 1)
  (corfu-popupinfo-mode 1)
  (global-corfu-mode 1))
#+end_src

* corfu-candidate-overlay

#+begin_src emacs-lisp
(use-package corfu-candidate-overlay :demand
  :disabled t
  :after corfu
  :bind (("C-<tab>" . completion-at-point)
	 ("C-!" . corfu-candidate-overlay-complete-at-point))
  :config
  ;; enable corfu-candidate-overlay mode globally
  ;; this relies on having corfu-auto set to nil
  (corfu-candidate-overlay-mode +1))
#+end_src

* cape

#+begin_src emacs-lisp
(use-package cape
  :defer t
  :bind (("C-c f" . cape-file)
         ("C-c h" . cape-history))
  :init
  (defun my/add-shell-completion ()
    (add-to-list 'completion-at-point-functions 'cape-history)
    (add-to-list 'completion-at-point-functions 'pcomplete-completions-at-point))
  (add-hook 'shell-mode-hook #'my/add-shell-completion)
  :config
  (advice-add #'comint-completion-at-point :around #'cape-wrap-nonexclusive)
  (advice-add #'pcomplete-completions-at-point :around #'cape-wrap-silent)
  (advice-add #'pcomplete-completions-at-point :around #'cape-wrap-purify))
#+end_src

* dabbrev

#+begin_src emacs-lisp
(use-package dabbrev
  :disabled t
  :demand
  :bind (("M-/" . dabbrev-completion)
         ("C-M-/" . dabbrev-expand))
  :config
  (add-to-list 'dabbrev-ignored-buffer-regexps "\\` ")
  (add-to-list 'dabbrev-ignored-buffer-modes 'doc-view-mode)
  (add-to-list 'dabbrev-ignored-buffer-modes 'pdf-view-mode)
  (add-to-list 'dabbrev-ignored-buffer-modes 'tags-table-mode))
#+end_src

